bigjosh/Move38-Arduino-Platform/avr/boards.txt
##########################################
## 
## This file to use the Move38 Blinks platform
## with the Ardiuno IDE
## http://move38.com
##
##
## Orginally based on ATMEGA168PA settings from MiniCore
## https://github.com/MCUdude/MiniCore	
##
##########################################

tile.name=Blinks Tile
tile.upload.tool=avrdude
tile.upload.protocol=avrisp
tile.upload.maximum_size=15872
tile.upload.maximum_data_size=1024

tile.build.core=blinks
tile.build.board=AVR_Blink

# Note that we actually boot up with DIV8 fuse programmed, so 
# only running at 1Mhz. Then we switch the prescaller to /2 in init()
# so we are at 4Mhz by the time user code runs.
# This is done becuase 8Mhz might need a higher voltage than our battery can
# supply.

tile.build.f_cpu=4000000L

tile.build.mcu=atmega168pb

tile.c.extra_flags=-Wextra -flto
tile.c.elf.extra_flags=-w -flto
tile.cpp.extra_flags=-Wextra -flto
tile.ltoarcmd=avr-gcc-ar

# build.f_cpu=1000000L
build.mcu=atmega168pb
# build.board=AVR_Blink